Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dropout_2 (Dropout)         (None, 64)                0         
                                                                 
 dense_3 (Dense)             (None, 80)                5200      
                                                                 
 dropout_3 (Dropout)         (None, 80)                0         
                                                                 
 dense_4 (Dense)             (None, 50)                4050      
                                                                 
 dense_5 (Dense)             (None, 28)                1428      
                                                                 
=================================================================
Total params: 10,678
Trainable params: 10,678
Non-trainable params: 0
_________________________________________________________________